import { Injectable } from '@angular/core';
import { environment } from '../environments/environment.development';
import { HttpClient, HttpHeaders } from '@angular/common/http';
import { Observable, of } from 'rxjs';

@Injectable({
  providedIn: 'root',
})
export class NewsService {
  newsCardsData = [
    {
      id: '1',
      categoryid: '16',
      title: 'ERI-001A',
      description: 'Захирал сандалЗахирал сандалЗахирал сандалЗахирал сандал',
      price: '100000',
      info: 'Суудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болон  ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал',
      readcount: '0',
      picurl:
        'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
      small_picurl: 'images/product/w-576/urdaas_bage.jpg',
      home_picurl: 'images/product/Cover_zurag.jpg',
      home_small_picurl: 'images/product/w-576/Cover_zurag.jpg',
      bgcolor: '#000000',
      status: '1',
      created_at: '2024-09-06 12:19:43',
      created_user: '0',
      updated_at: '2024-09-25 04:06:38',
      updated_user: '0',
      slider: [
        {
          id: '4',
          product_id: '22',
          position: 'left',
          picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          small_picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          created_at: '2024-09-26 14:07:54',
          created_user: 'admin',
          updated_at: null,
          updated_user: '',
        },
        {
          id: '5',
          product_id: '22',
          position: 'right',
          picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          small_picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          created_at: '2024-09-26 14:07:58',
          created_user: 'admin',
          updated_at: null,
          updated_user: '',
        },
      ],
    },
    {
      id: '2',
      categoryid: '16',
      title: 'ERI-001A',
      description: 'Захирал сандалЗахирал сандалЗахирал сандалЗахирал сандал',
      price: '100000',
      info: 'Суудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болон  ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал',
      readcount: '0',
      picurl:
        'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
      small_picurl: 'images/product/w-576/urdaas_bage.jpg',
      home_picurl: 'images/product/Cover_zurag.jpg',
      home_small_picurl: 'images/product/w-576/Cover_zurag.jpg',
      bgcolor: '#000000',
      status: '1',
      created_at: '2024-09-17 12:19:43',
      created_user: '0',
      updated_at: '2024-09-25 04:06:38',
      updated_user: '0',
      slider: [
        {
          id: '4',
          product_id: '22',
          position: 'left',
          picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          small_picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          created_at: '2024-09-26 14:07:54',
          created_user: 'admin',
          updated_at: null,
          updated_user: '',
        },
        {
          id: '5',
          product_id: '22',
          position: 'right',
          picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          small_picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          created_at: '2024-09-26 14:07:58',
          created_user: 'admin',
          updated_at: null,
          updated_user: '',
        },
      ],
    },
    {
      id: '3',
      categoryid: '16',
      title: 'ERI-001A',
      description: 'Захирал сандалЗахирал сандалЗахирал сандалЗахирал сандал',
      price: '100000',
      info: 'Суудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болон  ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал',
      readcount: '0',
      picurl:
        'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
      small_picurl: 'images/product/w-576/urdaas_bage.jpg',
      home_picurl: 'images/product/Cover_zurag.jpg',
      home_small_picurl: 'images/product/w-576/Cover_zurag.jpg',
      bgcolor: '#000000',
      status: '1',
      created_at: '2024-09-8 12:19:43',
      created_user: '0',
      updated_at: '2024-09-25 04:06:38',
      updated_user: '0',
      slider: [
        {
          id: '4',
          product_id: '22',
          position: 'left',
          picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          small_picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          created_at: '2024-09-26 14:07:54',
          created_user: 'admin',
          updated_at: null,
          updated_user: '',
        },
        {
          id: '5',
          product_id: '22',
          position: 'right',
          picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          small_picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          created_at: '2024-09-09 14:07:58',
          created_user: 'admin',
          updated_at: null,
          updated_user: '',
        },
      ],
    },
    {
      id: '4',
      categoryid: '16',
      title: 'ERI-001A',
      description: 'Захирал сандалЗахирал сандалЗахирал сандалЗахирал сандал',
      price: '100000',
      info: 'Суудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болон  ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал',
      readcount: '0',
      picurl:
        'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
      small_picurl: 'images/product/w-576/urdaas_bage.jpg',
      home_picurl: 'images/product/Cover_zurag.jpg',
      home_small_picurl: 'images/product/w-576/Cover_zurag.jpg',
      bgcolor: '#000000',
      status: '1',
      created_at: '2024-09-10 12:19:43',
      created_user: '0',
      updated_at: '2024-09-25 04:06:38',
      updated_user: '0',
      slider: [
        {
          id: '4',
          product_id: '22',
          position: 'left',
          picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          small_picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          created_at: '2024-09-26 14:07:54',
          created_user: 'admin',
          updated_at: null,
          updated_user: '',
        },
        {
          id: '5',
          product_id: '22',
          position: 'right',
          picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          small_picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          created_at: '2024-09-26 14:07:58',
          created_user: 'admin',
          updated_at: null,
          updated_user: '',
        },
      ],
    },
    {
      id: '5',
      categoryid: '16',
      title: 'ERI-001A',
      description: 'Захирал сандалЗахирал сандалЗахирал сандалЗахирал сандал',
      price: '100000',
      info: 'Суудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болон  ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал',
      readcount: '0',
      picurl:
        'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
      small_picurl: 'images/product/w-576/urdaas_bage.jpg',
      home_picurl: 'images/product/Cover_zurag.jpg',
      home_small_picurl: 'images/product/w-576/Cover_zurag.jpg',
      bgcolor: '#000000',
      status: '1',
      created_at: '2024-09-06 12:19:43',
      created_user: '0',
      updated_at: '2024-09-25 04:06:38',
      updated_user: '0',
      slider: [
        {
          id: '4',
          product_id: '22',
          position: 'left',
          picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          small_picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          created_at: '2024-09-26 14:07:54',
          created_user: 'admin',
          updated_at: null,
          updated_user: '',
        },
        {
          id: '5',
          product_id: '22',
          position: 'right',
          picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          small_picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          created_at: '2024-09-26 14:07:58',
          created_user: 'admin',
          updated_at: null,
          updated_user: '',
        },
      ],
    },
    {
      id: '6',
      categoryid: '16',
      title: 'ERI-001A',
      description: 'Захирал сандалЗахирал сандалЗахирал сандалЗахирал сандал',
      price: '100000',
      info: 'Суудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болонь арьсаар хийгдсэнСуудал болон  ар нь арьсаар хийгдсэнСуудал болон ар нь арьсаар хийгдсэнСуудал',
      readcount: '0',
      picurl:
        'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
      small_picurl: 'images/product/w-576/urdaas_bage.jpg',
      home_picurl: 'images/product/Cover_zurag.jpg',
      home_small_picurl: 'images/product/w-576/Cover_zurag.jpg',
      bgcolor: '#000000',
      status: '1',
      created_at: '2024-09-06 12:19:43',
      created_user: '0',
      updated_at: '2024-09-25 04:06:38',
      updated_user: '0',
      slider: [
        {
          id: '4',
          product_id: '22',
          position: 'left',
          picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          small_picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          created_at: '2024-09-26 14:07:54',
          created_user: 'admin',
          updated_at: null,
          updated_user: '',
        },
        {
          id: '5',
          product_id: '22',
          position: 'right',
          picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          small_picurl:
            'https://plus.unsplash.com/premium_photo-1731326956762-a37455b6bb0e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHwyfHx8ZW58MHx8fHx8',
          created_at: '2024-09-26 14:07:58',
          created_user: 'admin',
          updated_at: null,
          updated_user: '',
        },
      ],
    },
  ];

  apiUrl = environment.apiUrl;

  constructor(private http: HttpClient) {}

  // Fetch news list from the API
  newslist(): Observable<any> {
    return this.http.get(this.apiUrl + 'news');
  }

  // Fetch news details by ID (unchanged)
  getNewsDetails(id: string) {
    return this.newsCardsData.filter((news) => news.id === id);
  }

  // Get all news: either fetch from local data or from API
  getAllNews(): Observable<any> {
    // If using local data:
    return of(this.newsCardsData);

    // OR if fetching from API:
    // return this.http.get(this.apiUrl + 'news');
  }
}
