{
  "Бидний тухай": "About Us",
  "Мэндчилгээ": "Greeting",
  "Танилцуулга": "Introduction",
  "Бүтэц, зохион байгуулалт": "Structure and Organization",
  "Эрдмийн зөвлөл": "Academic Council",
  "Стратегийн зорилтууд": "Strategic Goals",
  "Судалгааны чиглэлүүд": "Research Leading and Main Directions",
  "Салбарууд": "Sectors",
  "Захиргаа": "Administration",
  "Чулуун зэвсгийн судалгаа": "Stone Age Research",
  "Хүрэл ба төмөр зэвсгийн судалгаа": "Bronze and Iron Age Research",
  "Хүннү ба эртний улсуудын судалгаа": "Hunnus and Ancient States Research",
  "Дундад зууны судалгаа": "Medieval Research",
  "Инноваци ба хамтын ажиллагаа": "Innovation and Cooperation",
  "Архив ба лаборатори": "Archive and Laboratory",
  "Хууль, дүрэм журам": "Laws and Regulations",
  "Хууль": "Laws",
  "Дүрэм журам": "Regulations",
  "Ил тод байдал": "Transparency",
  "Судалгаа": "Research",
  "Амжилтууд": "Achievements",
  "Эрдэм шинжилгээний хурал": "Scientific Conferences",
  "Онцгой үзэсгэлэн": "Special Exhibitions",
  "Дотоод хамтын ажиллагаа": "Domestic Cooperation",
  "Олон улсын хамтын ажиллагаа": "International Cooperation",
  "Хэвлэл нийтлэл": "Publications",
  "Монографууд": "Monographs",
  "Хамтын бүтээл, нийтлэлүүд": "Collaborative Works and Publications",
  "Археологийн судлал сэтгүүл": "Journal of Archaeological Studies",
  "Цахим сэтгүүл": "Electronic Journal 'Mongolian Archaeology News'",
  "Галерей": "Gallery",
  "Баримтат кино": "Documentary Films",
  "Нэвтрүүлэг, ярилцлага": "Broadcasts and Interviews",
  "Нийтлэлүүд": "Articles",
  "Зурагт цомог": "Photo Albums",
  "NEWS_INFORMATION": "News and Information",
  "Холбоо барих": "Contact",
  "Шинжлэх Ухааны Академийн Ботаникийн Цэцэрлэгт Хүрээлэнгийн Ахмад ажилтан, Биологийн шинжлэх ухааны доктор, профессор Г.Очирбат “Шинжлэх Ухааны Гавьяат Зүтгэлтэн” Цол тэмдгээр шагнагдлаа": "Dr. G. Ochirbat, Senior Researcher of the Botanical Garden and Research Institute of the Mongolian Academy of Sciences, Doctor of Biological Sciences, and Professor, has been awarded the title of 'Honored Scientist of Mongolia'.",
  "ХАА-н шинжлэх ухааны академийн гишүүн, биологийн шинжлэх ухааны доктор, профессор Гэндэнгийн Очирбатыг боловсрол, шинжлэх ухааны хөгжил дэвшилд ялангуяа Монголын ургамлын нөөц судлалын шинжлэх ухаан, чацарганы аж ахуйг хөгжүүлэх үйлст үнэтэй хувь нэмэр оруулсан, Зөгийн аж ахуйн тэжээлийн баазыг судалж, зөгийн аж ахуйг хөгжүүлэх стратеги бодлогыг боловсруулах шинжлэх ухааны үндсийг тавьсан хийгээд зөгийн аж ахуйг хөгжүүлэхэд шинжлэх ухаан, үйлдвэрлэл, сургалтыг хослуулан ажилласан ажлын өгөөжийг үндэслэн Монгол улсын Ерөнхийлөгчийн зарлигаар “МОНГОЛ УЛСЫН ШИНЖЛЭХ УХААНЫ ГАВЬЯАТ ЗҮТГЭЛТЭН” цол тэмдгээр шагналаа.": "Dr. Genden's Ochirbat, Member of the Mongolian Academy of Agricultural Sciences, Doctor of Biological Sciences, and Professor, has made significant contributions to the development of education and science, particularly in the fields of Mongolian plant resource studies and the development of sea buckthorn farming. He conducted research on the nutritional base of beekeeping and laid the scientific foundation for the development of strategies and policies for advancing the beekeeping industry. Combining science, industry, and education, his work has resulted in valuable outcomes for the development of beekeeping. Based on these contributions, he was awarded the title of 'Honored Scientist of Mongolia' by the decree of the President of Mongolia."
}
